Repository: hnrobert/PodDock
Catalog: PodDock/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: @ or www
zh_hans: @ 或 www

source: %lld records
zh_hans: %lld 条记录

source: About
zh_hans: 关于

source: Accounts
zh_hans: 账户

source: Add
zh_hans: 添加

source: Add Account…
zh_hans: 添加账户…

source: Add DNSPod Account
zh_hans: 添加 DNSPod 账户

source: Add Domain
zh_hans: 添加域名

source: Add Record
zh_hans: 添加记录

source: AI Assistant
zh_hans: AI 助手

source: All Types
zh_hans: 全部类型

source: Allow %@
zh_hans: 允许 %@

source: API error (%lld): %@
zh_hans: API 错误(%lld):%@

source: Ask anything about your DNS…
zh_hans: 随便问你的 DNS…

source: Assistant
zh_hans: 助手

source: Banned
zh_hans: 封禁

source: Batch complete (%lld items)
zh_hans: 批量操作完成(%lld 条)

source: Batch finished %1$lld/%2$lld, failed: %3$@
zh_hans: 完成 %1$lld/%2$lld,失败:%3$@

source: Batch running…
zh_hans: 批量执行中…

source: By Added Time
zh_hans: 按添加时间

source: By Name
zh_hans: 按名称

source: By TTL
zh_hans: 按 TTL

source: By Type
zh_hans: 按类型

source: By Weight
zh_hans: 按权重

source: Cancel
zh_hans: 取消

source: Cancelled
zh_hans: 已取消

source: Check via DoH
zh_hans: DoH 检测

source: Clear
zh_hans: 清空

source: Click to enable
zh_hans: 点击启用

source: Click to pause
zh_hans: 点击暂停

source: Coming in M3
zh_hans: M3 里程碑提供

source: Connect with a DNSPod API Token. It is stored only in this Mac's Keychain.
zh_hans: 使用 DNSPod API Token 连接你的账户。Token 只保存在本机 Keychain。

source: Console → Account → API Keys.
zh_hans: 控制台 → 账户 → API 密钥。

source: Copy
zh_hans: 复制

source: Copy Domain
zh_hans: 复制域名

source: Copy Value
zh_hans: 复制记录值

source: Credentials for %@ are no longer valid; please re-add the account.
zh_hans: 账户 %@ 的凭据已失效,请重新添加。

source: Decline
zh_hans: 拒绝

source: Default DoH Provider
zh_hans: 默认 DoH 服务商

source: Display name; defaults to last 4 digits of the ID
zh_hans: 显示名称,默认取 ID 后 4 位

source: DNS Assistant
zh_hans: DNS 助手

source: DNSPod Console
zh_hans: DNSPod 控制台

source: Domains
zh_hans: 域名

source: Done
zh_hans: 完成

source: Done Selecting
zh_hans: 完成选择

source: e.g. 123456
zh_hans: 例如 123456

source: Edit Record %@
zh_hans: 修改记录 %@

source: Edit…
zh_hans: 编辑…

source: Enable
zh_hans: 启用

source: Enable Selected (%lld)
zh_hans: 启用所选(%lld)

source: Enabled
zh_hans: 已启用

source: Endpoint
zh_hans: 端点

source: Error
zh_hans: 出错了

source: External AI clients operate the same account as this app. The bearer token is endpoint protection, independent of DNSPod credentials.
zh_hans: 外部 AI 客户端操作的是 App 正在管理的同一账户。Bearer 仅保护端点,与 DNSPod 凭据相互独立。

source: Face ID / Touch ID App Lock
zh_hans: Face ID / Touch ID 应用锁

source: Failed to load types/lines: %@ (you can type manually)
zh_hans: 类型/线路获取失败:%@(可直接手填)

source: Falls back to the system resolver when DoH is unreachable; results are labeled by source.
zh_hans: DoH 不可达时自动回退系统解析,结果会标注来源。

source: Host
zh_hans: 主机记录

source: Identity verification is required at cold start; credentials stay encrypted in the local Keychain and never sync.
zh_hans: 开启后冷启动需验证身份;凭据本身始终加密存于本机 Keychain(不随设备迁移)。

source: IPv4 address, e.g. 203.0.113.10
zh_hans: IPv4 地址,如 203.0.113.10

source: IPv6 address
zh_hans: IPv6 地址

source: Keychain operation failed (OSStatus %lld)
zh_hans: Keychain 操作失败(OSStatus %lld)

source: Label
zh_hans: 标签

source: Label (optional)
zh_hans: 标签(可选)

source: Legacy API
zh_hans: 传统 API

source: Line
zh_hans: 线路

source: LLM provider is not configured — set it up in Settings
zh_hans: LLM 未配置——请先在设置中完成配置

source: LLM request failed (HTTP %lld): %@
zh_hans: LLM 请求失败(HTTP %lld):%@

source: Loading available types and lines…
zh_hans: 正在获取可用类型与线路…

source: Local MCP Service
zh_hans: 本地 MCP 服务

source: Locked
zh_hans: 锁定

source: Mail server hostname
zh_hans: 邮件服务器主机名

source: Model
zh_hans: 模型

source: MX Priority
zh_hans: MX 优先级

source: Network request failed: %@
zh_hans: 网络请求失败:%@

source: No answers — the change may not be live yet, or the type differs.
zh_hans: 没有查询到记录——可能尚未生效或类型不符。

source: No DNSPod account — add one first.
zh_hans: 尚无 DNSPod 账户——请先添加。

source: No Records
zh_hans: 暂无解析记录

source: Not implemented: %@
zh_hans: 尚未实现:%@

source: Notice
zh_hans: 提示

source: OK
zh_hans: 好

source: Only removes local credentials; your DNSPod account is untouched.
zh_hans: 仅从本机移除凭据,不影响 DNSPod 账号本身。

source: Open the DNSPod console to create an API Token
zh_hans: 打开 DNSPod 控制台创建 API Token

source: OpenAI-compatible
zh_hans: OpenAI 兼容

source: Operation succeeded, but saving the remark failed (%@)
zh_hans: 操作已成功,但备注保存失败(%@)

source: Optional
zh_hans: 可选

source: Optional, load balancing
zh_hans: 可选,负载均衡

source: Pause
zh_hans: 暂停

source: Pause DNS
zh_hans: 暂停解析

source: Pause Selected (%lld)
zh_hans: 暂停所选(%lld)

source: Paused
zh_hans: 已暂停

source: Pick a domain in the sidebar to view and manage its records
zh_hans: 在侧栏选择一个域名,查看与管理它的解析记录

source: PodDock Locked
zh_hans: PodDock 已锁定

source: Propagation
zh_hans: 解析检测

source: Propagation Check
zh_hans: 解析生效检测

source: Provider
zh_hans: 提供商

source: Query
zh_hans: 查询

source: Record
zh_hans: 记录

source: Records stop resolving immediately. This cannot be undone.
zh_hans: 删除后解析立即失效,不可恢复。

source: Records will be removed one by one; failures are listed when done.
zh_hans: 将顺序删除所选记录,失败项会在完成后逐条列出。

source: Refresh
zh_hans: 刷新

source: Remark
zh_hans: 备注

source: Remark - %@
zh_hans: 备注 - %@

source: Remark text (empty to clear)
zh_hans: 备注内容(留空即清除)

source: Remark updated
zh_hans: 备注已更新

source: Remark: %@
zh_hans: 备注:%@

source: Remark…
zh_hans: 备注…

source: Remove
zh_hans: 移除

source: Remove %@
zh_hans: 删除 %@

source: Remove %@? Its records will stop resolving.
zh_hans: 确定删除域名 %@?该域名的解析将一并失效。

source: Remove %lld Records
zh_hans: 批量删除 %lld 条记录

source: Remove Account
zh_hans: 删除账户

source: Remove All
zh_hans: 全部删除

source: Remove Domain
zh_hans: 删除域名

source: Remove Domain…
zh_hans: 删除域名…

source: Remove Record
zh_hans: 删除记录

source: Remove Selected (%lld)…
zh_hans: 删除所选(%lld)…

source: Remove…
zh_hans: 删除…

source: Resume DNS
zh_hans: 启用解析

source: Run MCP server on this Mac
zh_hans: 在本机运行 MCP 服务

source: Save
zh_hans: 保存

source: Search domains
zh_hans: 搜索域名

source: Search host / value / remark
zh_hans: 搜索主机/值/备注

source: secret
zh_hans: 密钥

source: Security
zh_hans: 安全

source: Select
zh_hans: 选择

source: Select a Domain
zh_hans: 选择域名

source: Sort
zh_hans: 排序

source: Source: %@
zh_hans: 来源:%@

source: Source: system resolver (DoH unreachable)
zh_hans: 来源:系统解析(DoH 不可达时回退)

source: Switch
zh_hans: 切换

source: Target hostname
zh_hans: 目标主机名

source: Text content
zh_hans: 文本内容

source: The key is stored only in this Mac's Keychain. Write operations always require your confirmation.
zh_hans: 密钥只保存在本机 Keychain。写操作始终需要你的确认。

source: Tool loop limit reached
zh_hans: 工具循环达到上限

source: Try: “list my domains” or “point www of example.com to 1.2.3.4”
zh_hans: 试试:「列出我的域名」或「把 example.com 的 www 指向 1.2.3.4」

source: TTL (seconds)
zh_hans: TTL(秒)

source: Type
zh_hans: 类型

source: Unexpected LLM response: %@
zh_hans: LLM 响应异常:%@

source: Unexpected response format: %@
zh_hans: 响应格式异常:%@

source: Unknown
zh_hans: 未知

source: Unlock
zh_hans: 解锁

source: Unlock PodDock to manage your DNS
zh_hans: 解锁 PodDock 以管理你的解析

source: Use + in the toolbar to add the first record
zh_hans: 点击工具栏 + 添加第一条记录

source: Value
zh_hans: 记录值

source: Verification failed
zh_hans: 验证未通过

source: Verify & Add
zh_hans: 验证并添加

source: Version
zh_hans: 版本

source: Weight (0–100)
zh_hans: 权重(0–100)
